/*
 * Задача 20:
 * Да се състави програма, чрез която се извежда квадрат от
 * цифри. Сумите от елементите на произволен ред или стълб са
 * равни на 45.
 * 1 2 3 4 5 6 7 8 9 0
 * 2 3 4 5 6 7 8 9 0 1
 * 3 4 5 6 7 8 9 0 1 2
 * 4 5 6 7 8 9 0 1 2 3
 * 5 6 7 8 9 0 1 2 3 4
 * 6 7 8 9 0 1 2 3 4 5
 * 7 8 9 0 1 2 3 4 5 6
 * 8 9 0 1 2 3 4 5 6 7
 * 9 0 1 2 3 4 5 6 7 8
 * 0 1 2 3 4 5 6 7 8 9
 */
public class SquareOfSums {

	public static void main(String[] args) {
		for (int i = 1; i <= 10; i++) {
			for (int j = i; j < 10 + i; j++) {
				System.out.print(j % 10);
			}
			System.out.println();
		}
	}
}