/*
 * Задача 1: Да се изведат на екрана числата от 1 до 100.
 */
public class Task1 {

	public static void main(String[] args) {
		for (int index = 1; index <= 100; index++) {
			System.out.print(index + " ");
		}
	}

}