/*
 * Задача 2: Да се изведат на екрана числат от -20 до 50.
 */
public class Task2 {

	public static void main(String[] args) {
		for (int index = -20; index <= 50; index++) {
			System.out.print(index + " ");
		}
	}

}
