/*
 * Задача 4: Да се изведат на екрана числата от 10 до 1 в обратен ред.
 */
public class Task4 {

	public static void main(String[] args) {
		for (int index = 10; index > 0; index--) {
			System.out.print(index + " ");
		}
	}

}
