import java.util.Scanner;

/*
 * Задача 22:
 * Да се състави програма, която извежда първите 10 най-малки
 * числа, които се делят на 2, 3 или на 5 и които са по-големи от
 * въведено естествено число.
 * Числата се извеждат, заедно с техния пореден номер.
 * Входни данни: число от интервала [1..999]
 * Пример: 1
 * Изход: 1:2; 2:3, 3:4, 4:5, 5:6, 6:8, 7:9, 8:10, 9:12, 10:14
 * Използвайте цикъл while.
 */
public class TenNumbers {

	public static void main(String[] args) {
		Scanner sc = new Scanner(System.in);
		System.out.println("Въведете число: ");
		int number = sc.nextInt();
		byte k = 0;
		while (k < 10) {
			// Увеличаваме го още в началото, защото се иска изведените числа да
			// са по-големи от въведеното число.
			number++;
			if (number % 2 == 0 || number % 3 == 0 || number % 5 == 0) {
				k++;
				System.out.print(k + ":" + number + ", ");
			}

		}
	}
}